# Ranking DataFrames

### Import de Bibliotecas

In [1]:
import pandas as pd

In [2]:
sales = pd.Series([15, 32, 45, 21, 55, 15, 0], index=["Seg", "Ter", "Qua", "Qui", "Sex", "Sab", "Dom"])

In [3]:
sales

Seg    15
Ter    32
Qua    45
Qui    21
Sex    55
Sab    15
Dom     0
dtype: int64

In [4]:
sales.sort_values(ascending=False)

Sex    55
Qua    45
Ter    32
Qui    21
Seg    15
Sab    15
Dom     0
dtype: int64

### Organizar o ranking de valores(dia de maior venda para dia de menor venda)

In [15]:
sales.rank(ascending=False, method= "min").sort_values(ascending=True)

Sex    1.0
Qua    2.0
Ter    3.0
Qui    4.0
Seg    5.0
Sab    5.0
Dom    7.0
dtype: float64

In [16]:
sales.rank(ascending=False, method="average", pct=True).sort_values()

Sex    0.142857
Qua    0.285714
Ter    0.428571
Qui    0.571429
Seg    0.785714
Sab    0.785714
Dom    1.000000
dtype: float64

In [17]:
titanic = pd.read_csv('../Course_Materials_Part1/Video_Lecture_NBs/titanic.csv')

In [21]:
titanic.fare.rank(ascending=False)

0      815.0
1      103.0
2      659.5
3      144.0
4      628.0
       ...
886    484.5
887    237.5
888    345.5
889    237.5
890    768.5
Name: fare, Length: 891, dtype: float64

In [22]:
titanic["fare_rank"] = titanic.fare.rank(ascending=False, method="min")

In [23]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,deck,fare_rank
0,0,3,male,22.0,1,0,7.2500,S,NaN,809.0
1,1,1,female,38.0,1,0,71.2833,C,C,103.0
2,1,3,female,26.0,0,0,7.9250,S,NaN,651.0
3,1,1,female,35.0,1,0,53.1000,S,C,142.0
4,0,3,male,35.0,0,0,8.0500,S,NaN,607.0

In [24]:
titanic.sort_values(by="fare", ascending=False)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,deck,fare_rank
258,1,1,female,35.0,0,0,512.3292,C,NaN,1.0
737,1,1,male,35.0,0,0,512.3292,C,B,1.0
679,1,1,male,36.0,0,1,512.3292,C,B,1.0
88,1,1,female,23.0,3,2,263.0000,S,C,4.0
27,0,1,male,19.0,3,2,263.0000,S,C,4.0
...,...,...,...,...,...,...,...,...,...,...
633,0,1,male,NaN,0,0,0.0000,S,NaN,877.0
413,0,2,male,NaN,0,0,0.0000,S,NaN,877.0
822,0,1,male,38.0,0,0,0.0000,S,NaN,877.0
732,0,2,male,NaN,0,0,0.0000,S,NaN,877.0
674,0,2,male,NaN,0,0,0.0000,S,NaN,877.0

In [25]:
titanic.drop(columns="fare_rank", inplace=True)